In [5]:
import pandas as pd

In [6]:
customers = pd.read_csv('customers.csv')

In [7]:
orders = pd.read_csv('orders.csv')

In [8]:
products = pd.read_csv('products.csv')

In [9]:
products.head()

  product_id product_name     category   price
0       P001        Stage     Clothing  534.93
1       P002        Least  Accessories   56.56
2       P003       Number         Home  339.92
3       P004      Evening     Clothing  138.74
4       P005      Protect     Footwear   68.06

In [10]:
customers.head()

  customer_id      name  age gender               city
0       C0001  Jennifer   56   Male      Morrisonmouth
1       C0002   William   46   Male  Port Charlesshire
2       C0003     Ellen   32   Male  South Thomasmouth
3       C0004     Sheri   60   Male         West Megan
4       C0005    Taylor   25   Male         Josephland

In [11]:
orders.head()

  order_id customer_id product_id  quantity  order_date
0   O00001       C0333       P022         1  2022-01-09
1   O00002       C0068       P090         1  2022-01-27
2   O00003       C0483       P021         1  2022-01-17
3   O00004       C0214       P076         4  2022-01-07
4   O00005       C0411       P073         4  2022-01-12

In [12]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2584 entries, 0 to 2583
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   order_id     2584 non-null   object
 1   customer_id  2584 non-null   object
 2   product_id   2584 non-null   object
 3   quantity     2584 non-null   int64
 4   order_date   2584 non-null   object
dtypes: int64(1), object(4)
memory usage: 101.1+ KB

In [13]:
orders.order_date

0       2022-01-09
1       2022-01-27
2       2022-01-17
3       2022-01-07
4       2022-01-12
           ...
2579    2024-12-22
2580    2024-12-05
2581    2024-12-12
2582    2024-12-16
2583    2024-12-01
Name: order_date, Length: 2584, dtype: object

In [14]:
pd.to_datetime(orders.order_date)

0      2022-01-09
1      2022-01-27
2      2022-01-17
3      2022-01-07
4      2022-01-12
          ...
2579   2024-12-22
2580   2024-12-05
2581   2024-12-12
2582   2024-12-16
2583   2024-12-01
Name: order_date, Length: 2584, dtype: datetime64[ns]

In [15]:
orders.order_date = pd.to_datetime(orders.order_date)

In [16]:
top_products =orders[orders['order_date'].dt.year == 2022]['product_id'].value_counts()

In [17]:
top_products

product_id
P059    17
P090    15
P041    15
P099    15
P022    14
        ..
P032     4
P054     3
P023     3
P040     3
P005     3
Name: count, Length: 100, dtype: int64

In [18]:
products[products['product_id'] == top_products.index[0]]['product_name']

58    Network
Name: product_name, dtype: object

In [19]:
merged_orders = orders.merge(products[['product_id','price']], on = 'product_id',how='left')

In [20]:
merged_orders['total_price']=merged_orders.quantity*merged_orders.price

In [21]:
merged_orders

     order_id customer_id product_id  quantity order_date   price  total_price
0      O00001       C0333       P022         1 2022-01-09  185.33       185.33
1      O00002       C0068       P090         1 2022-01-27  947.55       947.55
2      O00003       C0483       P021         1 2022-01-17  938.65       938.65
3      O00004       C0214       P076         4 2022-01-07  154.17       616.68
4      O00005       C0411       P073         4 2022-01-12  131.85       527.40
...       ...         ...        ...       ...        ...     ...          ...
2579   O02580       C0237       P098         5 2024-12-22  567.31      2836.55
2580   O02581       C0236       P007         1 2024-12-05  325.74       325.74
2581   O02582       C0029       P035         1 2024-12-12  362.04       362.04
2582   O02583       C0171       P077         1 2024-12-16  233.11       233.11
2583   O02584       C0421       P038         5 2024-12-01  817.52      4087.60

[2584 rows x 7 columns]

In [22]:
orders_2022 = merged_orders[merged_orders['order_date'].dt.year == 2022]

In [23]:
orders_2022.customer_id.value_counts().max()

np.int64(6)

In [24]:
orders_2022.customer_id.value_counts().index[0]

'C0028'

In [25]:
customers[customers['customer_id']==orders_2022.customer_id.value_counts().index[0]]

   customer_id     name  age gender          city
27       C0028  Crystal   61   Male  Theodoreland

In [26]:
revenue = merged_orders['total_price'].sum()

In [27]:
revenue

np.float64(4134260.59)

In [38]:
customer_counts = merged_orders['customer_id'].value_counts()

In [39]:
customer_counts

customer_id
C0028    13
C0113    13
C0243    12
C0475    11
C0108    11
         ..
C0279     1
C0260     1
C0152     1
C0400     1
C0263     1
Name: count, Length: 498, dtype: int64

In [40]:
top_product_id = orders['product_id'].value_counts().idxmax()

In [41]:
top_product_id

'P041'

In [42]:
least_sold_product_id = orders['product_id'].value_counts().idxmin()

In [49]:
yearly_sales_mean = merged_orders.groupby(merged_orders['order_date'].dt.year)['total_price'].mean()

In [55]:
yearly_sales_mean

order_date
2022    1639.493213
2023    1611.548712
2024    1547.703365
Name: total_price, dtype: float64

In [51]:
monthly_sales = merged_orders.groupby(merged_orders['order_date'].dt.to_period('M'))['total_price'].mean()

In [52]:
monthly_sales

order_date
2022-01    1763.705354
2022-02    1776.073784
2022-03    1573.116489
2022-04    1814.901091
2022-05    1483.703800
2022-06    1594.738354
2022-07    1656.527759
2022-08    1603.166875
2022-09    1696.704643
2022-10    1332.971695
2022-11    1684.349620
2022-12    1609.776393
2023-01    1471.978243
2023-02    1765.162632
2023-03    1487.677753
2023-04    1606.954118
2023-05    1629.408878
2023-06    1613.716400
2023-07    1699.299403
2023-08    1517.755309
2023-09    1750.488947
2023-10    1616.637126
2023-11    1726.512564
2023-12    1555.695765
2024-01    1427.680500
2024-02    1656.206705
2024-03    1372.618333
2024-04    1663.550959
2024-05    1572.510667
2024-06    1769.518750
2024-07    1328.875556
2024-08    1563.042642
2024-09    1619.434026
2024-10    1483.996429
2024-11    1332.746588
2024-12    1779.846462
Freq: M, Name: total_price, dtype: float64